Revit 2027 API
AdaptiveComponentInstanceUtils.IsAdaptiveComponentInstance Method
 Verifies if a FamilyInstance is an Adaptive Component Instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAdaptiveComponentInstance(
	FamilyInstance famInst
)
Public Shared Function IsAdaptiveComponentInstance (
	famInst As FamilyInstance
) As Boolean
public:
static bool IsAdaptiveComponentInstance(
	FamilyInstance^ famInst
)
static member IsAdaptiveComponentInstance :
        famInst : FamilyInstance -> bool
Parameters
famInst FamilyInstance
 The FamilyInstance
Return Value
Boolean
 True if the FamilyInstance has an Adaptive Component Instances.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace